jiale-huang/STM32_Beginning/SPI_Software/DMA_Simple/Drivers/ADC.c
#include "Drivers/ADC.h"
#include "stm32f10x.h"


void AD_Init()
{
	// Enable RCC periph clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	// Enable ADC clock
	// Note: ADC maximum frequency is 14MHz, 72MHz / 6 = 12 MHz
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);	
	// Enable GPIOA clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	// Configure GPIO_A_Pin_0
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; //Analog input
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);		
	
	// Configure ADC channel
	ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_55Cycles5);
	
	// Configure ADC parameter
	ADC_InitTypeDef ADC_InitStructure;
	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;  // Continuous mode
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_NbrOfChannel = 1;
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_Init(ADC1, &ADC_InitStructure);
		
	// Enable ADC
	ADC_Cmd(ADC1, ENABLE);
	
	// Calibration ADC
	ADC_ResetCalibration(ADC1);
	while (ADC_GetResetCalibrationStatus(ADC1) == SET);  
	ADC_StartCalibration(ADC1);
	while (ADC_GetCalibrationStatus(ADC1) == SET);
	
	// Start to conversion
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);		
}

uint16_t AD_GetValue()
{
	return ADC_GetConversionValue(ADC1);	
}
